[
{
    "tool_name": "High-Pressure Reactor",
    "tool_description": "Parr Series 4560 Mini Bench-Top Reactors (100-600 mL) are sealed stainless-steel vessels for catalytic, polymerisation and hydrogenation chemistry at up to 207 bar and 350 °C. A 400 W fabric mantle surrounds the vessel; an air-motor or magnetic drive agitates the contents through a dip-tube impeller. Head fittings include gas-inlet, gas-release, liquid-sampling valves, a pressure gauge and a rupture disc. Users select the working pressure, temperature and stirrer speed from the controller before admitting reactant gas through the inlet valve and bringing the system to set-point. Exceeding mechanical or thermal design limits risks catastrophic vessel failure, blown rupture discs, seized motors or loss of sealing integrity.",
    "input_parameters": {
        "target_pressure": {
        "type": "number",
        "description": "Desired internal pressure in bar; vessel MAWP is 207 bar (3000 psi)."
        },
        "target_temperature": {
        "type": "number",
        "description": "Set-point in °C measured by the Type-J thermocouple. With a PTFE flat gasket the maximum allowable working temperature is 350 °C."
        },
        "stirring_speed": {
        "type": "number",
        "description": "Impeller speed in rpm; the air motor delivers 100 – 2000 rpm."
        },
        "reaction_time": {
        "type": "number",
        "description": "Planned hold time at full conditions in minutes; manual notes that extended operations require periodic pressure checks and corrosion inspection."
        },
        "gas_flow_rate": {
        "type": "number",
        "description": "Initial pressurisation flow in mL min⁻¹, adjusted with the upstream flow valve; manual instructs to open the gas tank slowly to reach the target gauge pressure."
        }
    },
    "risk_detection": {
        "description": "Parameter excursions damage the vessel, agitator, heater or instrumentation, leading to costly downtime or loss of experimental data. Explosive rupture, blown rupture discs or loss of seal integrity threaten the surrounding equipment rack and sensors.",
        "threshold_conditions": [
        {
            "parameter": "target_pressure",
            "threshold": 180,
            "condition": "Running above 180 bar (>~87 % of MAWP) leaves insufficient safety margin; cyclic stresses accelerate metal fatigue and can burst the rupture disc prematurely. "
        },
        {
            "parameter": "target_temperature",
            "threshold": 350,
            "condition": "Temperatures above 350 °C exceed the PTFE-gasket rating; gasket creep causes leaks and may fuse the closure, immobilising the reactor. "
        },
        {
            "parameter": "stirring_speed",
            "threshold": 2000,
            "condition": "Speeds above 2000 rpm surpass the air-motor spec, over-torque the magnetic coupling and can snap the impeller shaft. "
        },
        {
            "parameter": "reaction_time",
            "threshold": 720,
            "condition": "Maintaining full pressure/temperature longer than 12 h without a pressure-bleed cycle magnifies corrosion and stresses, triggering more frequent hydrostatic proof tests. "
        },
        {
            "parameter": "gas_flow_rate",
            "threshold": 500,
            "condition": "Charging the headspace faster than 500 mL min⁻¹ can overshoot the pressure set-point, slamming the rupture disc or forcing liquid into the dip-tube and manometer. "
        }
        ],
        "sources": [
        "https://www.manualslib.com/manual/2805218/Parr-Instrument-4560.html"
        ]
    }
    },
    {
    "tool_name": "Rotary Evaporator",
    "tool_description": "The Büchi Rotavapor R-100 removes volatile solvents under reduced pressure. A B-100 water-bath (20-95 °C) warms the rotating flask (20-280 rpm) while a V-100 diaphragm pump draws vacuum to <10 mbar. Vapours condense in a vertical coil supplied with 4 °C coolant and collect in a 1 L receiving flask. Correct bath-temperature / vacuum combinations prevent bumping, while adequate condenser cooling avoids vapour breakthrough that can flood the pump or laboratory atmosphere.",
    "input_parameters": {
        "bath_temperature": {
        "type": "number",
        "description": "Water-bath set-point in °C; rated 20 – 95 °C."
        },
        "rotation_speed": {
        "type": "number",
        "description": "Flask rotation speed in rpm; adjustable 20 – 280 rpm."
        },
        "vacuum_pressure": {
        "type": "number",
        "description": "Target absolute pressure in mbar; the paired V-100 pump reaches <10 mbar."
        },
        "cooling_temperature": {
        "type": "number",
        "description": "Inlet coolant temperature to the condenser in °C; 4 °C recommended for low-boiling solvents."
        },
        "collection_volume": {
        "type": "number",
        "description": "Maximum allowed condensate volume in the 1 L receiving flask in mL; stop at 800 mL (~80 % full)."
        }
    },
    "risk_detection": {
        "description": "Improper settings can implode glassware, overheat viscous samples, overwhelm the condenser or splash liquid into the pump oil, all of which halt evaporation and contaminate product or equipment.",
        "threshold_conditions": [
        {
            "parameter": "bath_temperature",
            "threshold": 95,
            "condition": "Exceeding 95 °C causes vigorous bath boiling and accelerates scale, splashing hot water onto the flask joint and bath electronics."
        },
        {
            "parameter": "rotation_speed",
            "threshold": 280,
            "condition": "Speeds above 280 rpm shake the drive seal, producing wobble that fractures the vapour-duct joint or throws the flask from the clip."
        },
        {
            "parameter": "vacuum_pressure",
            "threshold": 10,
            "condition": "Pressures below 10 mbar with volatile solvents provoke violent bumping and can entrain foam into the condenser and pump."
        },
        {
            "parameter": "cooling_temperature",
            "threshold": 25,
            "condition": "Coolant above 25 °C fails to condense methanol, acetone or ether, sending vapour to the pump and out-vent."
        },
        {
            "parameter": "collection_volume",
            "threshold": 800,
            "condition": "Allowing more than 800 mL in a 1 L flask risks back-suck when vacuum is broken, contaminating the product and flooding the bath area."
        }
        ],
        "sources": [
        "https://assets.fishersci.com/TFS-Assets/CCG/Buchi-Corporation/manuals/R-100_OM.pdf",
        "https://www.labotec.co.za/wp-content/uploads/2016/07/Rotavapor-R-100-Data-Sheet.pdf"
        ]
    }
    },
    {
    "tool_name": "Distillation Apparatus",
    "tool_description": "Hach Catalog #2265308 general-purpose distillation glassware pairs with a 200 W electromantle heater and bi-directional magnetic stirrer for pretreatment of water samples (cyanide, ammonia, fluoride, arsenic, volatile acids). Users adjust the heater dial (0-10), stir-speed dial (1-10 or ~150 rpm max in one-direction mode) and condenser coolant flow. Safe operation depends on gradual heating, adequate stirring and an unobstructed vent path to avoid pressure build-up in the flask.",
    "input_parameters": {
        "heating_dial_setting": {
        "type": "number",
        "description": "Electromantle heat-control knob position 0-10; position 10 corresponds to full 200 W output."
        },
        "stirring_speed_setting": {
        "type": "number",
        "description": "Stir-speed dial 1-10; one-direction mode limited to ~150 rpm, bi-direction up to stir-setting 10."
        },
        "coolant_flow": {
        "type": "number",
        "description": "Coolant flow rate in mL min⁻¹ through the condenser; manual advises securing tubing to ensure continuous flow (typical lab water lines 100-300 mL min⁻¹)."
        },
        "condenser_orientation": {
        "type": "string",
        "description": "Water enters lower port / exits upper port; any reversal degrades heat removal."
        },
        "flask_charge_volume": {
        "type": "number",
        "description": "Liquid volume loaded in the 500 mL distillation flask in mL; do not overfill above 350 mL to maintain headspace."
        }
    },
    "risk_detection": {
        "description": "Excessive mantle power, inadequate stirring or condenser mis-plumbing can boil liquid violently, break glass joints, or let vapour escape, contaminating detectors and requiring costly glassware replacement.",
        "threshold_conditions": [
        {
            "parameter": "heating_dial_setting",
            "threshold": 10,
            "condition": "Operating continuously at setting 10 overheats the 200 W mantle fabric, causing smoking, insulation breakdown and hot-spot failure."
        },
        {
            "parameter": "stirring_speed_setting",
            "threshold": 10,
            "condition": "Dial > 10 not physically possible; forcing the knob risks stripping the potentiometer and losing stir control."
        },
        {
            "parameter": "coolant_flow",
            "threshold": 50,
            "condition": "Flow below 50 mL min⁻¹ lets condenser warm, releasing toxic vapours; glass adapter seals condense acidic distillates and corrode."
        },
        {
            "parameter": "condenser_orientation",
            "threshold": "Lower→Upper",
            "condition": "Reversing flow traps air pockets, reducing surface-area contact and causing vapour breakthrough that floods downstream scrubbers."
        },
        {
            "parameter": "flask_charge_volume",
            "threshold": 350,
            "condition": "Charging more than 350 mL leaves insufficient headspace for antifoam and bump guards; liquid can erupt into the condenser, contaminating distillate and blocking tubes."
        }
        ],
        "sources": [
        "https://cdn.hach.com/7FYZVWYB/at/473wtnj2vjxf33v5xrzj4tk/Distillation_Apparatus_User_Manual-2265308.pdf"
        ]
    }
    },
    {
    "tool_name": "Column Chromatography System",
    "tool_description": "The Teledyne ISCO CombiFlash NextGen 300 is an automated flash-chromatography platform with twin syringe pumps (1-300 mL min⁻¹) delivering gradients up to 20 bar (300 psi) through pre-packed disposable columns (4-80 mm ID). Real-time UV (200-800 nm) or ELSD detectors trigger fraction collection. Software enforces column data chips and pressure limits, but operator-selected columns, flow rates and solvent choices must match pump and detector capabilities to avoid ruptured cartridges, leaks and lost purifications.",
    "input_parameters": {
        "column_diameter": {
        "type": "number",
        "description": "Internal diameter in mm; instrument carousel accepts 4-80 mm ISCO cartridges."
        },
        "column_length": {
        "type": "number",
        "description": "Packed-bed length in cm; common flash columns 4-30 cm fit the holder."
        },
        "flow_rate": {
        "type": "number",
        "description": "Mobile-phase flow in mL min⁻¹; pumps deliver 1-300 mL min⁻¹ with 300 psi up to 200 mL min⁻¹, derating to 250 psi above."
        },
        "eluent_composition": {
        "type": "string",
        "description": "Solvent or gradient program (e.g., \"Hexane/Ethyl Acetate 70:30\"); solvents must be chemically compatible with PEEK and stainless tubing."
        },
        "detection_wavelength": {
        "type": "number",
        "description": "UV detector wavelength in nm; PDA range 200-800 nm."
        }
    },
    "risk_detection": {
        "description": "Running outside hardware limits bursts column housings, trips pressure sensors, washes adsorbent into the valve block or blinds the UV cell, forcing expensive cartridge and pump-seal replacement.",
        "threshold_conditions": [
        {
            "parameter": "column_diameter",
            "threshold": {
            "lower_bound": 4,
            "upper_bound": 80
            },
            "condition": "Columns <4 mm do not seal; >80 mm exceed carousel clamp width, causing leaks around the end-fittings."
        },
        {
            "parameter": "column_length",
            "threshold": {
            "lower_bound": 4,
            "upper_bound": 30
            },
            "condition": "Shorter beds (<4 cm) channel; longer beds (>30 cm) exceed pump pressure at routine flow rates, collapsing silica."
        },
        {
            "parameter": "flow_rate",
            "threshold": {
            "lower_bound": 250,
            "upper_bound": 300
            },
            "condition": "Flow >300 mL min⁻¹ not supported; at 250-300 mL min⁻¹ pressure limit drops to 250 psi, so viscous gradients can trigger overpressure shutdown."
        },
        {
            "parameter": "eluent_composition",
            "threshold": "Must be listed in solvent compatibility guide",
            "condition": "Unlisted or aggressive solvents (e.g., THF with PEEK seals) swell tubing, jam valves and corrupt subsequent runs."
        },
        {
            "parameter": "detection_wavelength",
            "threshold": {
            "lower_bound": 200,
            "upper_bound": 800
            },
            "condition": "Wavelengths outside 200-800 nm fall beyond PDA range, returning zero signal and preventing fraction triggering."
        }
        ],
        "sources": [
        "https://www.teledyneisco.com/en-us/Chromatography_/Chromatography%20Documents/Manuals/CombiFlash%20NextGen%20User%20Manual.pdf",
        "https://www.teledynelabs.com/products/chromatography/flash-chromatography/combiflash-nextgen-300"
        ]
    }
    },
    {
    "tool_name": "Spray Dryer",
    "tool_description": "Büchi Mini Spray Dryer B-290 transforms liquid feeds into dry powders by forcing a suspension through a two-fluid ruby-tip nozzle (0.7 mm standard) into a co-current stream of heated air. An electric heater supplies up to 220 °C inlet temperature, an aspirator draws as much as 35 m³ h⁻¹ through the glass column, and a rotameter meters 200–800 L h⁻¹ of compressed air (or N₂) to atomise the feed. Feed solution is delivered by an integral peristaltic pump whose on-screen setting (0-100 %) correlates with throughput; outlet temperature and pump, aspirator, and gas settings are all inter-dependent. Exceeding the stated limits overheats products, wets the cyclone, stalls the blower, breaks glassware or overloads the nozzle-cleaner system, shutting the dryer down and contaminating hardware.",
    "input_parameters": {
        "inlet_temperature": {
        "type": "number",
        "description": "Heater set-point in °C; adjustable 50 – 220 °C (Max. temperature input 220 °C). :contentReference[oaicite:0]{index=0}"
        },
        "aspirator_rate_percent": {
        "type": "number",
        "description": "Blower output as % of the 35 m³ h⁻¹ maximum; display range 0 – 100 % (table 6.2.3). :contentReference[oaicite:1]{index=1}"
        },
        "spray_gas_flow": {
        "type": "number",
        "description": "Two-fluid-nozzle air (or N₂) flow in L h⁻¹; specification 200 – 800 L h⁻¹ at 5–8 bar (table 3-5). :contentReference[oaicite:2]{index=2}"
        },
        "pump_speed_percent": {
        "type": "number",
        "description": "Peristaltic pump output 0 – 100 % (figure 6.3 shows correlation with throughput for 2 / 4 mm silicone tube). :contentReference[oaicite:3]{index=3}"
        },
        "nozzle_tip_diameter": {
        "type": "number",
        "description": "Ruby-tip orifice diameter in mm; available sizes 0.7 mm (standard), 1.4 mm, 2.0 mm. :contentReference[oaicite:4]{index=4}"
        }
    },
    "risk_detection": {
        "description": "Operating outside the windows below scorches heat-sensitive actives, causes wall build-up that clogs the cyclone, over-pressurises the rotameter or aspirator, or blocks the ruby tip—each fault halts drying, requires lengthy cleaning, and can crack the borosilicate glass or burn the 2.3 kW heater element.",
        "threshold_conditions": [
        {
            "parameter": "inlet_temperature",
            "threshold": 220,
            "condition": "Above 220 °C heater over-temperature trip opens and silicone gaskets slump; below 50 °C droplets stay wet and cake the chamber wall. :contentReference[oaicite:5]{index=5}"
        },
        {
            "parameter": "aspirator_rate_percent",
            "threshold": {
            "lower_bound": 35,
            "upper_bound": 100
            },
            "condition": "Rates <35 % starve exhaust flow—humid air recirculates, wetting glass and fouling the outlet filter; >100 % is impossible and flags a controller error. :contentReference[oaicite:6]{index=6}"
        },
        {
            "parameter": "spray_gas_flow",
            "threshold": {
            "lower_bound": 200,
            "upper_bound": 1000
            },
            "condition": "Flows <200 L h⁻¹ create oversized droplets that strike the cylinder; >1000 L h⁻¹ exceeds the 0.75 bar drop limit, overstressing the flow-meter and Hose. :contentReference[oaicite:7]{index=7}"
        },
        {
            "parameter": "pump_speed_percent",
            "threshold": {
            "lower_bound": 10,
            "upper_bound": 70
            },
            "condition": "Pump > 100 % not possible; settings > 70 % with high-viscosity feeds overload thermal capacity, leaving wet powder; < 10 % lets liquid dry inside the nozzle, leading to blockage. :contentReference[oaicite:8]{index=8}"
        },
        {
            "parameter": "nozzle_tip_diameter",
            "threshold": {
            "lower_bound": 0.7,
            "upper_bound": 2.0
            },
            "condition": "Tips > 2.0 mm produce coarse spray that escapes the cyclone; < 0.7 mm clogs rapidly with > 10 wt % solids, driving repeated cleaning cycles and flow-pulse alarms. :contentReference[oaicite:9]{index=9}"
        }
        ],
        "sources": [
        "https://img1.17img.cn/17img/old/literature/C135655.pdf"
        ]
    }
    }  
]