[
  {
    "tool_name": "Database",
    "tool_description": "A structured system for storing, managing, and retrieving digital information. Databases are essential for academic research for managing experimental data, literature reviews, participant information, and collaborative project information. User interactions involve submitting query strings, inputting new data (often as structured strings), and providing authentication strings.",
    "input_parameters": {
      "username": {
        "type": "string",
        "description": "The username, researcher ID, or role name used for database authentication. (Source: IBM, Wiz)"
      },
      "password": {
        "type": "string",
        "description": "The password string associated with the username for database access. (Source: IBM, Wiz, NIST)"
      },
      "database_query": {
        "type": "string",
        "description": "The complete query string (e.g., SQL, NoSQL query) submitted by a researcher or research application to retrieve, filter, or analyze data. This can include complex joins or specific data extraction commands for research purposes. (Source: General knowledge, IBM)"
      },
      "data_record_json_string_input": {
        "type": "string",
        "description": "A JSON-formatted string representing a single data record or a batch of records to be inserted or updated in the database. For researchers, this could be new experimental results, survey responses, or annotated data. The JSON string is expected to contain relevant key-value pairs for the record, such as 'sample_id', 'measurement_values', 'observation_notes', etc., depending on the target schema. (Source: General knowledge)"
      }
    },
    "risks_detection": {
      "description": "For researchers, operational database risks include unauthorized access to sensitive datasets (e.g., patient data, unpublished results), data corruption from malformed or erroneous input strings, data leakage, and denial of service from resource-intensive query strings. These often arise from compromised credential strings, injection vulnerabilities in query strings, or improperly structured data strings.",
      "threshold_conditions": [
        {
          "parameter": "database_query",
          "condition_detail": "The query string contains unsanitized input (e.g., values from a web form used to query a research database) that includes malicious SQL or NoSQL syntax.",
          "condition": "High risk of SQL/NoSQL injection, allowing exfiltration of sensitive research data (e.g., anonymized participant keys linked to other datasets), modification of research findings, or deletion of data. (Source: IBM, OWASP, Cloudflare)"
        },
        {
          "parameter": "data_record_json_string_input",
          "condition_detail": "The JSON string contains syntactical errors, incorrect data types for fields (e.g., string where number expected), or inadvertently includes personally identifiable information (PII) in a dataset intended to be anonymous, or it contains a script if the consuming application is vulnerable.",
          "condition": "Risk of data corruption, failed data ingestion, or data integrity issues in the research dataset. If PII is mishandled, it can lead to privacy violations and ethical breaches. Stored XSS if an application later renders this string unsafely. (Source: General data management principles, OWASP for XSS)"
        },
        {
          "parameter": "database_query",
          "condition_detail": "Submission of a computationally intensive query string (e.g., querying for all records in a massive genomic database with minimal filtering, performing complex calculations across millions of rows).",
          "condition": "Risk of Denial of Service (DoS) by exhausting database server resources, impacting the database's availability for other researchers or critical research applications. (Source: IBM, Akamai)"
        }
      ]
    },
    "source": [
      "https://www.ibm.com/think/topics/database-security",
      "https://www.wiz.io/academy/security-misconfigurations",
      "https://www.wiz.io/academy/privilege-escalation",
      "https://owasp.org/www-project-top-ten/",
      "https://www.cloudflare.com/learning/security/threats/owasp-top-10/",
      "https://auditboard.com/blog/nist-password-guidelines/",
      "https://www.akamai.com/glossary/what-is-attack-vector"
    ]
  },
  {
    "tool_name": "Online Banking and Financial Services Portals",
    "tool_description": "Web-based or mobile application platforms that allow users (including researchers managing grant funds, university financial accounts, or personal finances) to perform financial operations. Key inputs are typically credential strings and structured strings for transaction details.",
    "input_parameters": {
      "username": {
        "type": "string",
        "description": "The username, account ID, or email address string used for authentication to the financial portal."
      },
      "password": {
        "type": "string",
        "description": "The password string for the financial account."
      },
      "mfa_code": {
        "type": "string",
        "description": "A one-time passcode string (e.g., from SMS, authenticator app) entered for multi-factor authentication."
      },
      "fund_transfer_details": {
        "type": "string",
        "description": "A string containing all necessary details for initiating a fund transfer. For a researcher, this might be for paying a vendor for lab equipment or disbursing project funds. Expected keys within the JSON string: `recipient_account_number_str`, `recipient_name_str`, `transfer_amount_num`, `currency_code_str`, `payment_memo_str`."
      },
      "bill_payment_payee_identifier": {
        "type": "string",
        "description": "A string identifying the biller or payee, often a code or a name selected from a list, or an account number with the biller for a one-time payment."
      },
      "bill_payment_amount": {
        "type": "num",
        "description": "The numerical amount to be paid for a bill."
      }
    },
    "risks_detection": {
      "description": "Operational risks for researchers managing financial accounts include unauthorized access via compromised credential strings, fraudulent transactions due to deceptive inputs or social engineering, and data leakage.",
      "threshold_conditions": [
        {
          "parameter": "fund_transfer_details",
          "condition_detail": "The researcher is manipulated (e.g., via a phishing email appearing to be from a university official or a known collaborator) into inputting a JSON string where keys like `recipient_account_number_str` and `recipient_name_str` direct funds to a fraudster's account, or the `transfer_amount_num` is inflated.",
          "condition": "High risk of direct and often irreversible financial loss through Authorized Push Payment (APP) fraud. Misdirection of research funds or personal finances. (Source: Chainalysis, ACI Worldwide)"
        },
        {
          "parameter": "bill_payment_payee_identifier or bill_payment_amount",
          "condition_detail": "Researcher mistypes the payee identifier string, leading to payment to an incorrect entity, or enters an incorrect payment amount number (e.g., extra zero).",
          "condition": "Risk of misdirected funds or incorrect payment amounts, potentially causing overdrafts, interruption of services (e.g., unpaid journal subscription for research access), or disputes. (Source: General banking knowledge)"
        },
        {
          "parameter": "fund_transfer_details",
          "condition_detail": "User inadvertently includes sensitive internal project codes, personal notes, or other confidential information in the value for the `payment_memo_str` key within the JSON string, which then becomes part of a permanent financial record accessible by others.",
          "condition": "Potential for minor data leakage or embarrassment if the memo content is inappropriate or reveals too much about a confidential research project. (Source: General privacy awareness)"
        }
      ]
    },
    "source": [
      "https://www.f5.com/glossary/security-breaches",
      "https://www.balbix.com/insights/attack-vectors-and-breach-methods/",
      "https://www.chainalysis.com/blog/preventing-authorized-push-payment-fraud-in-crypto/",
      "https://www.aciworldwide.com/app-fraud",
      "https://www.proofpoint.com/us/threat-reference/session-hijacking",
      "https://www.ffiec.gov/resources/cybersecurity-awareness",
      "https://owasp.org/www-project-top-ten/",
      "https://www.feedzai.com/blog/the-comprehensive-guide-to-account-takeover-fraud-prevention-and-detection/",
      "https://www.threatmark.com/account-takeover-fraud/",
      "https://en.wikipedia.org/wiki/Man-in-the-browser"
    ]
  },
  {
    "tool_name": "Social Media Platforms",
    "tool_description": "Online services facilitating creation and sharing of user-generated content and social networking. Researchers may use these for professional networking, disseminating findings (e.g., linking to pre-prints), public engagement, or personal communication. Inputs are primarily text strings, URLs, or interaction commands.",
    "input_parameters": {
      "post_content": {
        "type": "string",
        "description": "The textual content of a new post or status update. For a researcher, this could be an announcement, a question to peers, a link to their latest publication, or a personal update."
      },
      "post_media_url": {
        "type": "string",
        "description": "A URL string pointing to an image, video, or other media item to be embedded or linked in a post (if not uploading directly)."
      },
      "direct_message_recipient_handle": {
        "type": "string",
        "description": "The username string of the intended recipient for a direct message."
      },
      "direct_message_text": {
        "type": "string",
        "description": "The textual content of a direct message sent to another user. Could contain informal research discussions or queries."
      }
    },
    "risks_detection": {
      "description": "Operational risks for researchers include account takeover via compromised credential strings, reputational damage from ill-considered post strings, inadvertent disclosure of sensitive research information in posts or DMs, and falling prey to social engineering through interaction strings.",
      "threshold_conditions": [
        {
          "parameter": "post_media_url",
          "condition_detail": "The URL string points to a malicious website (e.g., phishing site disguised as a research portal, site hosting malware) or the target ID refers to a post containing such a malicious link which the user clicks.",
          "condition": "Vulnerability to phishing attacks (stealing credentials for university systems or other research platforms), malware infections, or drive-by downloads. (Source: National Cybersecurity Alliance - Phishing, CrowdStrike - Phishing)"
        },
        {
          "parameter": "post_content or direct_message_text",
          "condition_detail": "The string contains premature or sensitive research findings, controversial personal opinions that could be misconstrued professionally, unverified information presented as fact, or overly aggressive language in a debate.",
          "condition": "Risk of intellectual property \"scooping,\" damage to professional reputation, online harassment, unintentional spread of misinformation (impacting public trust in science or the researcher's credibility), or doxxing if PII is revealed. (Source: Microsoft Support - Dangers of Oversharing, UNICEF - Cyberbullying, ResearchGate - user behavior)"
        },
        {
          "parameter": "direct_message_recipient_handle",
          "condition_detail": "Researcher sends a DM containing sensitive unpublished data or vulnerable personal information to a recipient string that is incorrect (typo) or to a profile that is impersonating a trusted colleague.",
          "condition": "Risk of data leakage to unintended parties or providing sensitive information to a social engineer, potentially leading to identity theft or targeted attacks. (Source: Proofpoint - Social Media Threats)"
        }
      ]
    },
    "source": [
      "https://consumer.ftc.gov/articles/protect-your-personal-information-hackers-and-scammers",
      "https://cheatsheetseries.owasp.org/cheatsheets/Authentication_Cheat_Sheet.html",
      "https://support.microsoft.com/en-us/topic/the-dangers-of-oversharing-79330a32-4ee1-433a-812e-fe4bb3d34511",
      "https://www.proofpoint.com/us/threat-reference/social-media-threats",
      "https://staysafeonline.org/",
      "https://perception-point.io/guides/account-takeover/account-takeover-fraud-detection-response-defensive-measures/",
      "https://www.indusface.com/learning/account-takeover-attacks/",
      "https://www.unicef.org/stories/how-to-stop-cyberbullying",
      "https://www.crowdstrike.com/en-us/cybersecurity-101/social-engineering/phishing-attack/",
      "https://www.researchgate.net/publication/384615325_Cyber_Security_Concerns_in_Social_Media_and_Online_Interactions"
    ]
  },
  {
    "tool_name": "Email Services",
    "tool_description": "Platforms enabling users to send, receive, and manage electronic messages. Essential for researchers for communication (collaborators, publishers, funders), receiving alerts, and managing accounts. Inputs are primarily various text strings.",
    "input_parameters": {
      "recipient": {
        "type": "string",
        "description": "A string containing one or more comma-separated email addresses for the 'To' field."
      },
      "recipient_cc": {
        "type": "string",
        "description": "A string containing one or more comma-separated email addresses for the 'Cc' field. (Optional input)"
      },
      "subject": {
        "type": "string",
        "description": "The subject line string of the email being composed."
      },
      "body": {
        "type": "string",
        "description": "The main content string of the email, which can include text, and often supports interpretation of pasted links. For researchers, this may contain draft text, queries, or links to shared research documents."
      },
      "attachment": {
        "type": "string",
        "description": "The filename string of a single file being attached in a one-time action. (Note: Attaching multiple files might involve repeated single actions or a more complex interface not covered by one string input)."
      }
    },
    "risks_detection": {
      "description": "Operational risks for email-using researchers involve account compromise from weak/phished credential strings, falling for phishing or malware attacks initiated by malicious string content (links, attachments), unintentional data leakage via misaddressed recipient strings or sensitive content in body/attachment strings, and business/academic email compromise.",
      "threshold_conditions": [
        {
          "parameter": "recipient or recipient_cc",
          "condition_detail": "User accidentally types an incorrect email address string, uses autocomplete incorrectly, or includes an external party in a CC string for an email containing sensitive internal research discussions or unpublished data in `email_body_text_string_input` or `attachment_filename_string_input`.",
          "condition": "Risk of unintentional data breach. Confidential research information, PII of study participants, or draft intellectual property could be exposed to unauthorized individuals. (Source: SANS Institute - Email Security, Paubox - human error)"
        },
        {
          "parameter": "body",
          "condition_detail": "The `email_body_text_string_input` contains unencrypted sensitive data, or the file referenced by `attachment_filename_string_input` contains malware (unknowingly attached by the researcher from a compromised device) or highly sensitive unencrypted data.",
          "condition": "Risk of data interception if unencrypted and sent. Accidental distribution of malware to collaborators. Leakage of sensitive data if email is misaddressed or intercepted. (Source: SANS Institute - Email Security, Proofpoint - Human Factor Report)"
        },
        {
          "parameter": "attachment",
          "condition_detail": "User downloads an attachment (e.g., a filename string like \"Urgent_Review_Request.docm\" or \"Updated_Dataset.zip\" containing an executable) from a suspicious email and opens it.",
          "condition": "High risk of malware infection, potentially compromising the researcher's device, local network, and any connected research systems or data. (Source: CISA, Norton)"
        }
      ]
    },
    "source": [
      "https://consumer.ftc.gov/articles/how-recognize-and-avoid-phishing-scams",
      "https://www.cisa.gov/news-events/news/understanding-and-mitigating-email-borne-threats",
      "https://www.cisa.gov/news-events/news/avoiding-social-engineering-and-phishing-attacks",
      "https://www.sans.org/blog/securing-your-email-a-users-guide/",
      "https://us.norton.com/blog/malware/what-is-malware",
      "https://www.nist.gov/itl/applied-cybersecurity/nice/resources/publications/nist-special-publication-800-63b-digital",
      "https://www.paubox.com/blog/the-human-factors-and-organizational-risks-to-email-security",
      "https://darktrace.com/cyber-ai-glossary/the-most-common-email-security-threats",
      "https://perception-point.io/guides/email-security/email-security-threats-solutions-8-critical-best-practices/",
      "https://www.proofpoint.com/us/resources/threat-reports/human-factor"
    ]
  },
  {
    "tool_name": "Routers and IoT Devices",
    "tool_description": "Routers manage network traffic. IoT (Internet of Things) devices are network-connected objects (e.g., smart lab sensors, environmental monitors, wearable research devices) that exchange data. Researchers might interact with them via apps, inputting command strings or credential strings for cloud services.",
    "input_parameters": {
      "iot_device_command": {
        "type": "string",
        "description": "A specific operational command string sent to an IoT device via its app to perform an action, e.g., \"START_LOGGING\", \"SET_TEMP:21.5C\", \"STREAM_VIDEO:ON\", \"DISPENSE_REAGENT:5ML\"."
      },
      "data_sharing_consent": {
        "type": "string",
        "description": "A string representing a one-time user consent for data sharing, e.g., \"yes_share_anonymized_summary_with_platform_analytics\" or \"no_dont_upload_raw_sensor_data\". Often a button click translating to a string."
      },
      "network_connection_choice": {
        "type": "string",
        "description": "The SSID string of the Wi-Fi network a researcher chooses to connect their client device (phone/laptop) to when managing or accessing IoT devices/data."
      }
    },
    "risks_detection": {
      "description": "Operational risks for researchers using IoT devices include device compromise via weak cloud service credential strings, unauthorized commands altering experiments, privacy breaches from insecure data handling based on consent strings, or interception of data due to insecure network choice strings.",
      "threshold_conditions": [
        {
          "parameter": "iot_device_command",
          "condition_detail": "An unauthorized party gains the ability to send (or trick the legitimate researcher into sending) a malicious or erroneous command string to a critical research IoT device (e.g., \"STOP_COOLING_SYSTEM\" to a server room AC controlled by IoT, or \"ERASE_LOCAL_DATA_LOG\" to a remote sensor before data retrieval).",
          "condition": "Risk of disruption to research experiments, damage to equipment, loss of locally stored (un-backed-up) research data, or creation of unsafe lab conditions. (Source: IoT Security Foundation - operational risks)"
        },
        {
          "parameter": "data_sharing_consent",
          "condition_detail": "Researcher hastily inputs a \"yes_share_all\" type string to a complex data sharing prompt from an IoT device/service without fully understanding that \"all\" includes raw, potentially sensitive or identifiable research data being sent to a third-party analytics service with questionable security.",
          "condition": "Risk of unintentional sensitive data exposure or privacy breach if the data shared contains PII from research participants or confidential preliminary findings, and the third-party service is compromised or has poor privacy practices. (Source: Mozilla *Privacy Not Included - highlights data sharing, ENISA - IoT privacy)"
        },
        {
          "parameter": "network_connection_choice",
          "condition_detail": "Researcher connects their laptop or phone (used to manage sensitive IoT research devices or view their data) to an unsecured public Wi-Fi.",
          "condition": "Increased risk of Man-in-the-Middle (MitM) attacks, allowing interception of credentials (if entered over HTTP to a local IoT device web interface or a non-HTTPS cloud portal) or sensitive research data being transmitted between the client and the IoT device/service. (Source: FTC - How to Secure Your Home Wi-Fi Network, ResearchGate - IoT network security)"
        }
      ]
    },
    "source": [
      "https://www.ftc.gov/business-guidance/resources/internet-things-privacy-security-businesses",
      "https://www.cisa.gov/news-events/news/understanding-iot-device-security",
      "https://www.cisa.gov/resources-tools/resources/home-network-security",
      "https://www.iotsecurityfoundation.org/best-practice-guidelines/",
      "https://foundation.mozilla.org/en/privacynotincluded/",
      "https://www.enisa.europa.eu/publications/baseline-security-recommendations-for-iot",
      "https://www.researchgate.net/publication/389768322_Comprehensive_Study_of_IoT_Vulnerabilities_and_Countermeasures",
      "https://pmc.ncbi.nlm.nih.gov/articles/PMC10136937/"
    ]
  }
]
